Klipper3d/klipper/lib/asf/sam/utils/cmsis/samv71/include/samv71q20b.h
/**
 * \file
 *
 * Copyright (c) 2017-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAMV71Q20B_
#define _SAMV71Q20B_

/** \addtogroup SAMV71Q20B_definitions SAMV71Q20B definitions
  This file defines all structures and symbols for SAMV71Q20B:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMV71Q20B */
/* ************************************************************************** */
/** \addtogroup SAMV71Q20B_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M7 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn        = -13, /**<  3 HardFault Interrupt                   */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M7 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M7 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M7 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M7 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M7 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M7 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M7 System Tick Interrupt       */
/******  SAMV71Q20B specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAMV71Q20B Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAMV71Q20B Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAMV71Q20B Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAMV71Q20B Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAMV71Q20B Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAMV71Q20B Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAMV71Q20B Enhanced Embedded Flash Controller (EFC) */
  UART0_IRQn           =  7, /**<  7 SAMV71Q20B UART 0 (UART0) */
  UART1_IRQn           =  8, /**<  8 SAMV71Q20B UART 1 (UART1) */
  PIOA_IRQn            = 10, /**< 10 SAMV71Q20B Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 11, /**< 11 SAMV71Q20B Parallel I/O Controller B (PIOB) */
  PIOC_IRQn            = 12, /**< 12 SAMV71Q20B Parallel I/O Controller C (PIOC) */
  USART0_IRQn          = 13, /**< 13 SAMV71Q20B USART 0 (USART0) */
  USART1_IRQn          = 14, /**< 14 SAMV71Q20B USART 1 (USART1) */
  USART2_IRQn          = 15, /**< 15 SAMV71Q20B USART 2 (USART2) */
  PIOD_IRQn            = 16, /**< 16 SAMV71Q20B Parallel I/O Controller D (PIOD) */
  PIOE_IRQn            = 17, /**< 17 SAMV71Q20B Parallel I/O Controller E (PIOE) */
  HSMCI_IRQn           = 18, /**< 18 SAMV71Q20B Multimedia Card Interface (HSMCI) */
  TWIHS0_IRQn          = 19, /**< 19 SAMV71Q20B Two Wire Interface 0 HS (TWIHS0) */
  TWIHS1_IRQn          = 20, /**< 20 SAMV71Q20B Two Wire Interface 1 HS (TWIHS1) */
  SPI0_IRQn            = 21, /**< 21 SAMV71Q20B Serial Peripheral Interface 0 (SPI0) */
  SSC_IRQn             = 22, /**< 22 SAMV71Q20B Synchronous Serial Controller (SSC) */
  TC0_IRQn             = 23, /**< 23 SAMV71Q20B Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAMV71Q20B Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAMV71Q20B Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 SAMV71Q20B Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 SAMV71Q20B Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 SAMV71Q20B Timer/Counter 5 (TC5) */
  AFEC0_IRQn           = 29, /**< 29 SAMV71Q20B Analog Front End 0 (AFEC0) */
  DACC_IRQn            = 30, /**< 30 SAMV71Q20B Digital To Analog Converter (DACC) */
  PWM0_IRQn            = 31, /**< 31 SAMV71Q20B Pulse Width Modulation 0 (PWM0) */
  ICM_IRQn             = 32, /**< 32 SAMV71Q20B Integrity Check Monitor (ICM) */
  ACC_IRQn             = 33, /**< 33 SAMV71Q20B Analog Comparator (ACC) */
  USBHS_IRQn           = 34, /**< 34 SAMV71Q20B USB Host / Device Controller (USBHS) */
  MCAN0_INT0_IRQn      = 35, /**< 35 SAMV71Q20B Controller Area Network (MCAN0) */
  MCAN0_INT1_IRQn      = 36, /**< 36 SAMV71Q20B Controller Area Network (MCAN0) */
  MCAN1_INT0_IRQn      = 37, /**< 37 SAMV71Q20B Controller Area Network (MCAN1) */
  MCAN1_INT1_IRQn      = 38, /**< 38 SAMV71Q20B Controller Area Network (MCAN1) */
  GMAC_IRQn            = 39, /**< 39 SAMV71Q20B Ethernet MAC (GMAC) */
  AFEC1_IRQn           = 40, /**< 40 SAMV71Q20B Analog Front End 1 (AFEC1) */
  TWIHS2_IRQn          = 41, /**< 41 SAMV71Q20B Two Wire Interface 2 HS (TWIHS2) */
  SPI1_IRQn            = 42, /**< 42 SAMV71Q20B Serial Peripheral Interface 1 (SPI1) */
  QSPI_IRQn            = 43, /**< 43 SAMV71Q20B Quad I/O Serial Peripheral Interface (QSPI) */
  UART2_IRQn           = 44, /**< 44 SAMV71Q20B UART 2 (UART2) */
  UART3_IRQn           = 45, /**< 45 SAMV71Q20B UART 3 (UART3) */
  UART4_IRQn           = 46, /**< 46 SAMV71Q20B UART 4 (UART4) */
  TC6_IRQn             = 47, /**< 47 SAMV71Q20B Timer/Counter 6 (TC6) */
  TC7_IRQn             = 48, /**< 48 SAMV71Q20B Timer/Counter 7 (TC7) */
  TC8_IRQn             = 49, /**< 49 SAMV71Q20B Timer/Counter 8 (TC8) */
  TC9_IRQn             = 50, /**< 50 SAMV71Q20B Timer/Counter 9 (TC9) */
  TC10_IRQn            = 51, /**< 51 SAMV71Q20B Timer/Counter 10 (TC10) */
  TC11_IRQn            = 52, /**< 52 SAMV71Q20B Timer/Counter 11 (TC11) */
  MLB_IRQn             = 53, /**< 53 SAMV71Q20B MediaLB (MLB) */
  AES_IRQn             = 56, /**< 56 SAMV71Q20B AES (AES) */
  TRNG_IRQn            = 57, /**< 57 SAMV71Q20B True Random Generator (TRNG) */
  XDMAC_IRQn           = 58, /**< 58 SAMV71Q20B DMA (XDMAC) */
  ISI_IRQn             = 59, /**< 59 SAMV71Q20B Camera Interface (ISI) */
  PWM1_IRQn            = 60, /**< 60 SAMV71Q20B Pulse Width Modulation 1 (PWM1) */
  FPU_IRQn             = 61, /**< 61 SAMV71Q20B Floating Point Unit Registers (FPU) */
  SDRAMC_IRQn          = 62, /**< 62 SAMV71Q20B SDRAM Controller (SDRAMC) */
  RSWDT_IRQn           = 63, /**< 63 SAMV71Q20B Reinforced Safety Watchdog Timer (RSWDT) */
  CCW_IRQn             = 64, /**< 64 SAMV71Q20B System Control Registers (SystemControl) */
  CCF_IRQn             = 65, /**< 65 SAMV71Q20B System Control Registers (SystemControl) */
  GMAC_Q1_IRQn         = 66, /**< 66 SAMV71Q20B Gigabit Ethernet MAC (GMAC) */
  GMAC_Q2_IRQn         = 67, /**< 67 SAMV71Q20B Gigabit Ethernet MAC (GMAC) */
  IXC_IRQn             = 68, /**< 68 SAMV71Q20B Floating Point Unit Registers (FPU) */
  I2SC0_IRQn           = 69, /**< 69 SAMV71Q20B Inter-IC Sound Controller (I2SC0) */
  I2SC1_IRQn           = 70, /**< 70 SAMV71Q20B Inter-IC Sound controller (I2SC1) */
  GMAC_Q3_IRQn         = 71, /**< 71 SAMV71Q20B Gigabit Ethernet MAC (GMAC) */
  GMAC_Q4_IRQn         = 72, /**< 72 SAMV71Q20B Gigabit Ethernet MAC (GMAC) */
  GMAC_Q5_IRQn         = 73, /**< 73 SAMV71Q20B Gigabit Ethernet MAC (GMAC) */

  PERIPH_COUNT_IRQn    = 74  /**< Number of peripheral IDs */
} IRQn_Type;

